In [1]:
import pandas as pd

# Handling Categorical Text Data

Data which is divided among various classes, categories or groups is knows as categorical data

What ?

why ?

How ?

In [2]:
data = pd.read_csv("Social_Network_Ads_1.csv")
data

      User ID        Date   Country  Gender  Age  EstimatedSalary  Purchased
0    15624510  01-03-2012    France    Male   19          19000.0          0
1    15810944  01-04-2012     Italy    Male   35          20000.0          0
2    15668575  01-05-2012    France  Female   26          43000.0          0
3    15603246  01-06-2012   Germany  Female   27          57000.0          0
4    15804002  01-09-2012    France    Male   19          76000.0          0
..        ...         ...       ...     ...  ...              ...        ...
398  15691863  08-05-2013    France  Female   46          41000.0          1
399  15706071  08-06-2013     Italy    Male   51          23000.0          1
400  15654296  08-07-2013     Italy  Female   50          20000.0          1
401  15755018  08-08-2013   Germany    Male   36          33000.0          0
402  15594041  08-09-2013  Germany&  Female   49          36000.0          1

[403 rows x 7 columns]

Here , Gender, Country and Purchased are categorical data

In [3]:
data["Country"].nunique() # Gives the no.oF unique values of country

6

If the data is categorical in nature and the unique values is almost equal to the no of rows then we can drop that column. For example UserID

In [4]:
data["User ID"].nunique()

402

In [5]:
data.drop("User ID",axis=1,inplace=True)

In [6]:
data

           Date   Country  Gender  Age  EstimatedSalary  Purchased
0    01-03-2012    France    Male   19          19000.0          0
1    01-04-2012     Italy    Male   35          20000.0          0
2    01-05-2012    France  Female   26          43000.0          0
3    01-06-2012   Germany  Female   27          57000.0          0
4    01-09-2012    France    Male   19          76000.0          0
..          ...       ...     ...  ...              ...        ...
398  08-05-2013    France  Female   46          41000.0          1
399  08-06-2013     Italy    Male   51          23000.0          1
400  08-07-2013     Italy  Female   50          20000.0          1
401  08-08-2013   Germany    Male   36          33000.0          0
402  08-09-2013  Germany&  Female   49          36000.0          1

[403 rows x 6 columns]

###### What is meant by handling categorical data ?

If the categorical data is in text format like Gender, Country in the above data . In this case , If our data is applied to a mathematical machine learning model. It makes errors( Because we can't perform mathematical operations on text data ). So we need to convert this data into numerical format

There are  many machine learning models which work even if don't handle  missing values or outliers. But there is no machine learning model which works if we don't handle the categorical text data

Here purchased is fine 

In which, 

0-> Not Purchased

1-> Purchased

Here we have to handle the Country and Gender

In [7]:
data["Country"].unique() # Gives the uniques values from country columns

array(['France', 'Italy', 'Germany', ']Italy&', ']Germany&', 'Germany&'],
      dtype=object)

Here we can see that Because of some garbage value , some country names are repeating

### Handling Garbage Values

     1. Using Regex Patterns (Regular Expression)

In [8]:
import re

$Syntax : re.sub(Pattern,Replacement String,String To Apply Regex)$

In [9]:
re.sub("[^A-Za-z0-9]+","","]Italy&") # Anything other than Letters or numbers will be replaced with an empty string

'Italy'

In [10]:
re.sub("[^A-Za-z0-9]+","","]Germany&")

'Germany'

In [11]:
data["Country"] = data["Country"].apply(lambda x: re.sub("[^A-Za-z0-9]+","",x) )

In [12]:
data["Country"].unique()

array(['France', 'Italy', 'Germany'], dtype=object)

In [13]:
data["Gender"].unique() # Doesn't have any garbage values

array(['Male', 'Female'], dtype=object)

Now the data is perfect for conversion (Conversion to numeric data)
Converting(Encoding) categorical data into Numeric data

### Types of categorical data(Based on levels of measurement)

       1. Ordinal
    
       2. Nominal

####  Nominal Categorical Data

If the categorical data is representing categories without any priorities or order. All the categories having equal priorities and there is no specific order for the data is a nominal data

Example : Country, Gender 

'France', 'Italy', 'Germany'

Here all the categories have equal priorities and have no specific order

#### Ordinal Categorical Data

Data in which categories are having priorities is called ordinal data(We can order the data)

For example lets assume that we have a column for feedback. and in that we have categories

bad,good,worst,best

can be arrange this data in a proper order ? Yes

Worst,Bad,Good,Best

     or
     
Best,Good,Bad,Worst

These kinds of data where categories can be ordered is nothing but the ordinal data

Another Example :

For Recruitment Process 

Qualification Column with categories

School,SSLC,,Plus Two,UG,PG,PHD

Here each categorical will have a priority

###### If the data is nominal  we apply a technique called OneHot Ecnoding

###### If the data is ordinal we apply Mapping technique or  Ordinal Encoding

######  If we have large number of categories , we call it as high cardinality feature. We handle it differently

### One Hot Encoding

In Country we have three categories 

    France 
    Italy
    Germany
  
  If we encode like this
  
       France  -0
       Italy   -1
       Germany -2. 
       
       Here what happens is , Here data is converted and it is in numerical format. But the problem is we are giving an order  or priorities to the nominal data (Nominal data doesn't have any order or priorities). Here we are telling the model that Germany have more importance or priority than France or Italy. SO the model treat France with lower priority and Germany with a higher priority. To avoid this problem . we do One hot encoding

So in One Hot Encoding . We create a new column for every unique category. Here, A new Column for , Germany, Italy and France.

Then we start iterating through the data set. and for each customer with a particular country we give 1 to that particular country column and set zero to other two country columns. Here We are turning on and turning off the Three Country columns(France, Germany and Italy ) Based on the country of the user

Fro example if the country of the customer is France then ,

      France     Italy    Germany
      
        1         0          0
        

If the country if Customer is Germany then,

      France     Italy    Germany
      
        0          0         1

#### $In \ Pandas$ get_dummies() $is \ used \ to \ do \ One \ Hot \ Encoding$

     Syntax : pd.getdummies(data,columns=Columns_To_Apply_One_Hot_Encoding)

In [14]:
pd.get_dummies(data,columns = ["Country","Gender"])

,Date,Age,EstimatedSalary,Purchased,Country_France,Country_Germany,Country_Italy,Gender_Female,Gender_Male
0,01-03-2012,19,19000.0,0,1,0,0,0,1
1,01-04-2012,35,20000.0,0,0,0,1,0,1
2,01-05-2012,26,43000.0,0,1,0,0,1,0
3,01-06-2012,27,57000.0,0,0,1,0,1,0
4,01-09-2012,19,76000.0,0,1,0,0,0,1
...,...,...,...,...,...,...,...,...,...
398,08-05-2013,46,41000.0,1,1,0,0,1,0
399,08-06-2013,51,23000.0,1,0,0,1,0,1
400,08-07-2013,50,20000.0,1,0,0,1,1,0
401,08-08-2013,36,33000.0,0,0,1,0,0,1
402,08-09-2013,49,36000.0,1,0,1,0,1,0

In [15]:
data = pd.get_dummies(data,columns = ["Country","Gender"])

### Mapping Technique / Ordinal Encoding

In [19]:
data1 = pd.read_excel("drive.xlsx")
data1

        Name          college  Gender Education
0       Manu       SS College    Male        UG
1      Manas         Govt HSS    Male      SSLC
2     Platty       SS College    Male        PG
3    Punnara       SS College    Male       PHD
4     AKshay      U C College    Male        UG
5      Ajmal      U C College    Male        PG
6      Vikas      U C College    Male        UG
7      Shaji              MKM    Male  PLUS TWO
8      Sneha      U C College  Female        UG
9    Fousiya      U C College  Female        UG
10  Renjitha              CMS  Female       PHD
11      Mahi      U C College    Male        PG
12    Tharun          Nirmala    Male  PLUS TWO
13    Kannan      U C College    Male        UG
14     Negil  Govt HSS Kannur    Male      SSLC
15     Jithu      U C College    Male        PG
16     Githu       St. Joseph    Male      SSLC
17   Anandhu      U C College    Male       PHD

In [17]:
data1["Education"].unique() # Ordinal data in which each category have a priority

array(['UG', 'SSLC', 'PG', 'PHD', 'PLUS TWO'], dtype=object)

In [18]:
edu_dict = {'SSLC':0,'PLUS TWO':1,'UG':2,'PG':3,'PHD':4}

In [21]:
data1["Education"] = data1["Education"].map(edu_dict)

In [22]:
data1

        Name          college  Gender  Education
0       Manu       SS College    Male          2
1      Manas         Govt HSS    Male          0
2     Platty       SS College    Male          3
3    Punnara       SS College    Male          4
4     AKshay      U C College    Male          2
5      Ajmal      U C College    Male          3
6      Vikas      U C College    Male          2
7      Shaji              MKM    Male          1
8      Sneha      U C College  Female          2
9    Fousiya      U C College  Female          2
10  Renjitha              CMS  Female          4
11      Mahi      U C College    Male          3
12    Tharun          Nirmala    Male          1
13    Kannan      U C College    Male          2
14     Negil  Govt HSS Kannur    Male          0
15     Jithu      U C College    Male          3
16     Githu       St. Joseph    Male          0
17   Anandhu      U C College    Male          4